robovero/firmware/src/wrap/_lpc17xx_uart.c
/*******************************************************************************
 * @file
 * @purpose		
 * @version		0.1
 *------------------------------------------------------------------------------
 * Copyright (C) 2011 Gumstix Inc.
 * All rights reserved.
 *
 * Contributer(s):
 *   Neil MacMunn   <neil@gumstix.com>
 *------------------------------------------------------------------------------
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 * 
 * Redistributions of source code must retain the above copyright notice, this
 * 	list of conditions and the following disclaimer.
 * 
 * Redistributions in binary form must reproduce the above copyright notice,
 *  this list of conditions and the following disclaimer in the documentation
 *  and/or other materials provided with the distribution.
 * 
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 ******************************************************************************/

#include "lpc17xx_uart.h"

#include "return.h"

int _UART_RS485SendSlvAddr(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* UARTx;
	uint8_t SlvAddr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART1_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	SlvAddr = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);

	UART_RS485SendSlvAddr(UARTx, SlvAddr);
	return 0;
}

int _UART_ABClearIntPending(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;
	UART_ABEO_Type ABIntType;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	ABIntType = (UART_ABEO_Type) strtoul((char *) arg_ptr, NULL, 16);

	UART_ABClearIntPending(UARTx, ABIntType);
	return 0;
}

int _UART_IrDAPulseDivConfig(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;
	UART_IrDA_PULSE_Type PulseDiv;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	PulseDiv = (UART_IrDA_PULSE_Type) strtoul((char *) arg_ptr, NULL, 16);

	UART_IrDAPulseDivConfig(UARTx, PulseDiv);
	return 0;
}

int _UART_RS485Config(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* UARTx;
	UART1_RS485_CTRLCFG_Type* RS485ConfigStruct;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART1_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	RS485ConfigStruct = (UART1_RS485_CTRLCFG_Type*) strtoul((char *) arg_ptr, NULL, 16);

	UART_RS485Config(UARTx, RS485ConfigStruct);
	return 0;
}

int _UART_Receive(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;
	uint8_t* rxbuf;
	uint32_t buflen;
	TRANSFER_BLOCK_Type flag;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	rxbuf = (uint8_t*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	buflen = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	flag = (TRANSFER_BLOCK_Type) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) UART_Receive(UARTx, rxbuf, buflen, flag));
	writeUSBOutString(str);
	return 0;
}

int _UART_ReceiveByte(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) UART_ReceiveByte(UARTx));
	writeUSBOutString(str);
	return 0;
}

int _UART_GetIntId(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) UART_GetIntId(UARTx));
	writeUSBOutString(str);
	return 0;
}

int _UART_ForceBreak(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);

	UART_ForceBreak(UARTx);
	return 0;
}

int _UART_FIFOConfig(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;
	UART_FIFO_CFG_Type* FIFOCfg;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	FIFOCfg = (UART_FIFO_CFG_Type*) strtoul((char *) arg_ptr, NULL, 16);

	UART_FIFOConfig(UARTx, FIFOCfg);
	return 0;
}

int _UART_DeInit(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);

