robovero/firmware/src/wrap/_lpc17xx_uart.c
	UART_DeInit(UARTx);
	return 0;
}

int _UART_Send(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;
	uint8_t* txbuf;
	uint32_t buflen;
	TRANSFER_BLOCK_Type flag;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	txbuf = (uint8_t*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	buflen = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	flag = (TRANSFER_BLOCK_Type) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) UART_Send(UARTx, txbuf, buflen, flag));
	writeUSBOutString(str);
	return 0;
}

int _UART_FIFOConfigStructInit(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART_FIFO_CFG_Type* UART_FIFOInitStruct;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART_FIFOInitStruct = (UART_FIFO_CFG_Type*) strtoul((char *) arg_ptr, NULL, 16);

	UART_FIFOConfigStructInit(UART_FIFOInitStruct);
	return 0;
}

int _UART_FullModemForcePinState(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* UARTx;
	UART_MODEM_PIN_Type Pin;
	UART1_SignalState NewState;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART1_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	Pin = (UART_MODEM_PIN_Type) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	NewState = (UART1_SignalState) strtoul((char *) arg_ptr, NULL, 16);

	UART_FullModemForcePinState(UARTx, Pin, NewState);
	return 0;
}

int _UART_RS485ReceiverCmd(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* UARTx;
	FunctionalState NewState;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART1_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	NewState = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);

	UART_RS485ReceiverCmd(UARTx, NewState);
	return 0;
}

int _UART_CheckBusy(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) UART_CheckBusy(UARTx));
	writeUSBOutString(str);
	return 0;
}

int _UART_SendByte(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;
	uint8_t Data;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	Data = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);

	UART_SendByte(UARTx, Data);
	return 0;
}

int _UART_ABCmd(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;
	UART_AB_CFG_Type* ABConfigStruct;
	FunctionalState NewState;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	ABConfigStruct = (UART_AB_CFG_Type*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	NewState = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);

	UART_ABCmd(UARTx, ABConfigStruct, NewState);
	return 0;
}

int _UART_GetLineStatus(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) UART_GetLineStatus(UARTx));
	writeUSBOutString(str);
	return 0;
}

int _UART_FullModemConfigMode(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* UARTx;
	UART_MODEM_MODE_Type Mode;
	FunctionalState NewState;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART1_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	Mode = (UART_MODEM_MODE_Type) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	NewState = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);

	UART_FullModemConfigMode(UARTx, Mode, NewState);
	return 0;
}

int _UART_FullModemGetStatus(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* UARTx;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART1_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) UART_FullModemGetStatus(UARTx));
	writeUSBOutString(str);
	return 0;
}

int _UART_Init(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;
	UART_CFG_Type* UART_ConfigStruct;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART_ConfigStruct = (UART_CFG_Type*) strtoul((char *) arg_ptr, NULL, 16);

	UART_Init(UARTx, UART_ConfigStruct);
	return 0;
}

int _UART_IrDACmd(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;
	FunctionalState NewState;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	NewState = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);

	UART_IrDACmd(UARTx, NewState);
	return 0;
}

int _UART_TxCmd(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;
	FunctionalState NewState;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	NewState = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);

	UART_TxCmd(UARTx, NewState);
	return 0;
}

int _UART_ConfigStructInit(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART_CFG_Type* UART_InitStruct;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART_InitStruct = (UART_CFG_Type*) strtoul((char *) arg_ptr, NULL, 16);

