robovero/firmware/src/wrap/_lpc17xx_uart.c
	UART_ConfigStructInit(UART_InitStruct);
	return 0;
}

int _UART_IntConfig(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;
	UART_INT_Type UARTIntCfg;
	FunctionalState NewState;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTIntCfg = (UART_INT_Type) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	NewState = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);

	UART_IntConfig(UARTx, UARTIntCfg, NewState);
	return 0;
}

int _UART_IrDAInvtInputCmd(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* UARTx;
	FunctionalState NewState;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	NewState = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);

	UART_IrDAInvtInputCmd(UARTx, NewState);
	return 0;
}

int _UART_RS485SendData(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* UARTx;
	uint8_t* pData;
	uint32_t size;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UARTx = (LPC_UART1_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	pData = (uint8_t*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	size = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) UART_RS485SendData(UARTx, pData, size));
	writeUSBOutString(str);
	return 0;
}

int _UART_AB_MODE_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART_AB_MODE_Type)));
	writeUSBOutString(str);
	return 0;
}

int _UART1_RS485_CTRLCFG_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART1_RS485_CTRLCFG_Type)));
	writeUSBOutString(str);
	return 0;
}

int _UART1_RS485_CTRLCFG_Type_NormalMultiDropMode_State(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART1_RS485_CTRLCFG_Type* UART1_RS485_CTRLCFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART1_RS485_CTRLCFG_Type_ptr = (UART1_RS485_CTRLCFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART1_RS485_CTRLCFG_Type_ptr->NormalMultiDropMode_State);
		writeUSBOutString(str);
		return 0;
	}

	UART1_RS485_CTRLCFG_Type_ptr->NormalMultiDropMode_State = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART1_RS485_CTRLCFG_Type_Rx_State(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART1_RS485_CTRLCFG_Type* UART1_RS485_CTRLCFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART1_RS485_CTRLCFG_Type_ptr = (UART1_RS485_CTRLCFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART1_RS485_CTRLCFG_Type_ptr->Rx_State);
		writeUSBOutString(str);
		return 0;
	}

	UART1_RS485_CTRLCFG_Type_ptr->Rx_State = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART1_RS485_CTRLCFG_Type_AutoAddrDetect_State(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART1_RS485_CTRLCFG_Type* UART1_RS485_CTRLCFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART1_RS485_CTRLCFG_Type_ptr = (UART1_RS485_CTRLCFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART1_RS485_CTRLCFG_Type_ptr->AutoAddrDetect_State);
		writeUSBOutString(str);
		return 0;
	}

	UART1_RS485_CTRLCFG_Type_ptr->AutoAddrDetect_State = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART1_RS485_CTRLCFG_Type_AutoDirCtrl_State(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART1_RS485_CTRLCFG_Type* UART1_RS485_CTRLCFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART1_RS485_CTRLCFG_Type_ptr = (UART1_RS485_CTRLCFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART1_RS485_CTRLCFG_Type_ptr->AutoDirCtrl_State);
		writeUSBOutString(str);
		return 0;
	}

	UART1_RS485_CTRLCFG_Type_ptr->AutoDirCtrl_State = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART1_RS485_CTRLCFG_Type_DirCtrlPin(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART1_RS485_CTRLCFG_Type* UART1_RS485_CTRLCFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART1_RS485_CTRLCFG_Type_ptr = (UART1_RS485_CTRLCFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART1_RS485_CTRLCFG_Type_ptr->DirCtrlPin);
		writeUSBOutString(str);
		return 0;
	}

	UART1_RS485_CTRLCFG_Type_ptr->DirCtrlPin = (UART_RS485_DIRCTRL_PIN_Type) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART1_RS485_CTRLCFG_Type_DirCtrlPol_Level(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART1_RS485_CTRLCFG_Type* UART1_RS485_CTRLCFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART1_RS485_CTRLCFG_Type_ptr = (UART1_RS485_CTRLCFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART1_RS485_CTRLCFG_Type_ptr->DirCtrlPol_Level);
		writeUSBOutString(str);
		return 0;
	}

	UART1_RS485_CTRLCFG_Type_ptr->DirCtrlPol_Level = (SetState) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART1_RS485_CTRLCFG_Type_MatchAddrValue(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART1_RS485_CTRLCFG_Type* UART1_RS485_CTRLCFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART1_RS485_CTRLCFG_Type_ptr = (UART1_RS485_CTRLCFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART1_RS485_CTRLCFG_Type_ptr->MatchAddrValue);
		writeUSBOutString(str);
		return 0;
	}

	UART1_RS485_CTRLCFG_Type_ptr->MatchAddrValue = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART1_RS485_CTRLCFG_Type_DelayValue(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART1_RS485_CTRLCFG_Type* UART1_RS485_CTRLCFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART1_RS485_CTRLCFG_Type_ptr = (UART1_RS485_CTRLCFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART1_RS485_CTRLCFG_Type_ptr->DelayValue);
		writeUSBOutString(str);
		return 0;
	}

	UART1_RS485_CTRLCFG_Type_ptr->DelayValue = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART_IrDA_PULSE_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART_IrDA_PULSE_Type)));
	writeUSBOutString(str);
	return 0;
}

int _UART_MODEM_PIN_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART_MODEM_PIN_Type)));
	writeUSBOutString(str);
	return 0;
}

int _UART_FIFO_CFG_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART_FIFO_CFG_Type)));
	writeUSBOutString(str);
	return 0;
}

int _UART_FIFO_CFG_Type_FIFO_ResetRxBuf(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART_FIFO_CFG_Type* UART_FIFO_CFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART_FIFO_CFG_Type_ptr = (UART_FIFO_CFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART_FIFO_CFG_Type_ptr->FIFO_ResetRxBuf);
		writeUSBOutString(str);
		return 0;
	}

	UART_FIFO_CFG_Type_ptr->FIFO_ResetRxBuf = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART_FIFO_CFG_Type_FIFO_ResetTxBuf(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART_FIFO_CFG_Type* UART_FIFO_CFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART_FIFO_CFG_Type_ptr = (UART_FIFO_CFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART_FIFO_CFG_Type_ptr->FIFO_ResetTxBuf);
		writeUSBOutString(str);
		return 0;
	}

