robovero/firmware/src/wrap/_lpc17xx_uart.c
	UART_FIFO_CFG_Type_ptr->FIFO_ResetTxBuf = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART_FIFO_CFG_Type_FIFO_DMAMode(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART_FIFO_CFG_Type* UART_FIFO_CFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART_FIFO_CFG_Type_ptr = (UART_FIFO_CFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART_FIFO_CFG_Type_ptr->FIFO_DMAMode);
		writeUSBOutString(str);
		return 0;
	}

	UART_FIFO_CFG_Type_ptr->FIFO_DMAMode = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART_FIFO_CFG_Type_FIFO_Level(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART_FIFO_CFG_Type* UART_FIFO_CFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART_FIFO_CFG_Type_ptr = (UART_FIFO_CFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART_FIFO_CFG_Type_ptr->FIFO_Level);
		writeUSBOutString(str);
		return 0;
	}

	UART_FIFO_CFG_Type_ptr->FIFO_Level = (UART_FITO_LEVEL_Type) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART_STOPBIT_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART_STOPBIT_Type)));
	writeUSBOutString(str);
	return 0;
}

int _UART_ABEO_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART_ABEO_Type)));
	writeUSBOutString(str);
	return 0;
}

int _UART_RS485_DIRCTRL_PIN_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART_RS485_DIRCTRL_PIN_Type)));
	writeUSBOutString(str);
	return 0;
}

int _UART1_SignalState_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART1_SignalState)));
	writeUSBOutString(str);
	return 0;
}

int _UART_CFG_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART_CFG_Type)));
	writeUSBOutString(str);
	return 0;
}

int _UART_CFG_Type_Baud_rate(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART_CFG_Type* UART_CFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART_CFG_Type_ptr = (UART_CFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART_CFG_Type_ptr->Baud_rate);
		writeUSBOutString(str);
		return 0;
	}

	UART_CFG_Type_ptr->Baud_rate = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART_CFG_Type_Parity(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART_CFG_Type* UART_CFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART_CFG_Type_ptr = (UART_CFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART_CFG_Type_ptr->Parity);
		writeUSBOutString(str);
		return 0;
	}

	UART_CFG_Type_ptr->Parity = (UART_PARITY_Type) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART_CFG_Type_Databits(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART_CFG_Type* UART_CFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART_CFG_Type_ptr = (UART_CFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART_CFG_Type_ptr->Databits);
		writeUSBOutString(str);
		return 0;
	}

	UART_CFG_Type_ptr->Databits = (UART_DATABIT_Type) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART_CFG_Type_Stopbits(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART_CFG_Type* UART_CFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART_CFG_Type_ptr = (UART_CFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART_CFG_Type_ptr->Stopbits);
		writeUSBOutString(str);
		return 0;
	}

	UART_CFG_Type_ptr->Stopbits = (UART_STOPBIT_Type) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART_AB_CFG_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART_AB_CFG_Type)));
	writeUSBOutString(str);
	return 0;
}

int _UART_AB_CFG_Type_ABMode(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART_AB_CFG_Type* UART_AB_CFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART_AB_CFG_Type_ptr = (UART_AB_CFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART_AB_CFG_Type_ptr->ABMode);
		writeUSBOutString(str);
		return 0;
	}

	UART_AB_CFG_Type_ptr->ABMode = (UART_AB_MODE_Type) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART_AB_CFG_Type_AutoRestart(uint8_t * args)
{
	uint8_t * arg_ptr;
	UART_AB_CFG_Type* UART_AB_CFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	UART_AB_CFG_Type_ptr = (UART_AB_CFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) UART_AB_CFG_Type_ptr->AutoRestart);
		writeUSBOutString(str);
		return 0;
	}

	UART_AB_CFG_Type_ptr->AutoRestart = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _UART_MODEM_MODE_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART_MODEM_MODE_Type)));
	writeUSBOutString(str);
	return 0;
}

int _UART_FITO_LEVEL_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART_FITO_LEVEL_Type)));
	writeUSBOutString(str);
	return 0;
}

int _UART_INT_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART_INT_Type)));
	writeUSBOutString(str);
	return 0;
}

int _UART_LS_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART_LS_Type)));
	writeUSBOutString(str);
	return 0;
}

int _UART_DATABIT_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART_DATABIT_Type)));
	writeUSBOutString(str);
	return 0;
}

int _UART_MODEM_STAT_type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART_MODEM_STAT_type)));
	writeUSBOutString(str);
	return 0;
}

int _UART_PARITY_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(UART_PARITY_Type)));
	writeUSBOutString(str);
	return 0;
}

